nxp-appcodehub/dm-lpc860-smart-lighting/drivers/fsl_clock.h
/*
 *! @brief   Setup I3C FClk clock dividers.
 * @param   value: Value to be divided
 * @return  Nothing
 */
static inline void CLOCK_SetI3CFClkDiv(uint32_t value)
{
    assert(value != 0U);

    SYSCON->I3CCLKDIV =
        (SYSCON->I3CCLKDIV & (~SYSCON_I3CCLKDIV_I3C_FCLK_DIV_MASK)) | SYSCON_I3CCLKDIV_I3C_FCLK_DIV(value);
}

/*
 *! @brief   Setup I3C TC clock dividers.
 * @param   value: Value to be divided
 * @return  Nothing
 */
static inline void CLOCK_SetI3CTCClkDiv(uint32_t value)
{
    assert(value != 0U);

    SYSCON->I3CCLKDIV = (SYSCON->I3CCLKDIV & (~SYSCON_I3CCLKDIV_I3C_SLOW_TC_CLK_DIV_MASK)) |
                        SYSCON_I3CCLKDIV_I3C_SLOW_TC_CLK_DIV(value);
}

/*
 *! @brief   Setup I3C Slow clock dividers.
 * @param   value: Value to be divided
 * @return  Nothing
 */
static inline void CLOCK_SetI3CSClkDiv(uint32_t value)
{
    assert(value != 0U);

    SYSCON->I3CCLKDIV =
        (SYSCON->I3CCLKDIV & (~SYSCON_I3CCLKDIV_I3C_SLOW_CLK_DIV_MASK)) | SYSCON_I3CCLKDIV_I3C_SLOW_CLK_DIV(value);
}

/*! @brief  Set main clock reference source.
 * @param src Refer to clock_main_clk_src_t to set the main clock source.
 */
void CLOCK_SetMainClkSrc(clock_main_clk_src_t src);

/*! @brief Set FRO clock source
 * @param src Please refer to _clock_fro_src definition.
 *
 */
void CLOCK_SetFroOutClkSrc(clock_fro_src_t src);

/*
 *! @brief  Set Fractional generator multiplier value.
 * @param   base: Fractional generator register address
 * @param   mul : FRG multiplier value.
 * @return  Nothing
 */
static inline void CLOCK_SetFRGClkMul(uint32_t *base, uint32_t mul)
{
    CLK_FRG_DIV_REG_MAP(base) = SYSCON_FRG_FRGDIV_DIV_MASK;
    CLK_FRG_MUL_REG_MAP(base) = SYSCON_FRG_FRGMULT_MULT(mul);
}
/* @} */

/*!
 * @name Get frequency
 * @{
 */

/*! @brief  Return Frequency of FRG0 Clock.
 *  @return Frequency of FRG0 Clock.
 */
uint32_t CLOCK_GetFRG0ClkFreq(void);

/*! @brief  Return Frequency of FRG1 Clock.
 *  @return Frequency of FRG1 Clock.
 */
uint32_t CLOCK_GetFRG1ClkFreq(void);

/*! @brief  Return Frequency of Main Clock.
 *  @return Frequency of Main Clock.
 */
uint32_t CLOCK_GetMainClkFreq(void);

/*! @brief  Return Frequency of FRO.
 *  @return Frequency of FRO.
 */
uint32_t CLOCK_GetFroFreq(void);

/*! @brief  Return Frequency of core.
 *  @return Frequency of core.
 */
static inline uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    return CLOCK_GetMainClkFreq() / (SYSCON->SYSAHBCLKDIV & 0xffU);
}

/*! @brief  Return Frequency of ClockOut
 *  @return Frequency of ClockOut
 */
uint32_t CLOCK_GetClockOutClkFreq(void);

/*! @brief  Get UART0 frequency
 * @retval UART0 frequency value.
 */
uint32_t CLOCK_GetUart0ClkFreq(void);

/*! @brief  Get UART1 frequency
 * @retval UART1 frequency value.
 */
uint32_t CLOCK_GetUart1ClkFreq(void);

/*! @brief  Get UART2 frequency
 * @retval UART2 frequency value.
 */
uint32_t CLOCK_GetUart2ClkFreq(void);

/*! @brief  Get UART3 frequency
 * @retval UART3 frequency value.
 */
uint32_t CLOCK_GetUart3ClkFreq(void);

/*! @brief  Get UART4 frequency
 * @retval UART4 frequency value.
 */
uint32_t CLOCK_GetUart4ClkFreq(void);

/*! @brief  Get I3C frequency
 * @retval I3C frequency value.
 */
uint32_t CLOCK_GetI3cClkFreq(void);

/*! @brief  Get LP_OSC frequency
 * @retval LP_OSC frequency value.
 */
uint32_t CLOCK_GetLpOscClkFreq(void);

/*! @brief  Return Frequency of selected clock
 *  @return Frequency of selected clock
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName);

/*! @brief  Return System PLL input clock rate
 *  @return System PLL input clock rate
 */
uint32_t CLOCK_GetSystemPLLInClockRate(void);

/*! @brief  Return Frequency of System PLL
 *  @return Frequency of PLL
 */
static inline uint32_t CLOCK_GetSystemPLLFreq(void)
{
    return CLOCK_GetSystemPLLInClockRate() * ((SYSCON->SYSPLLCTRL & SYSCON_SYSPLLCTRL_MSEL_MASK) + 1U);
}

/*! @brief  Get low power OSC frequency
 * @retval low power OSC frequency value.
 */
static inline uint32_t CLOCK_GetLpOscFreq(void)
{
    return g_Lp_Osc_Freq;
}

/*! @brief  Get external clock frequency
 * @retval external clock frequency value.
 */
static inline uint32_t CLOCK_GetExtClkFreq(void)
{
    return g_Ext_Clk_Freq;
}
/* @} */

/*!
 * @name PLL operations
 * @{
 */

/*! @brief  System PLL initialize.
 *  @param config System PLL configurations.
 */
void CLOCK_InitSystemPll(const clock_sys_pll_t *config);

/*! @brief  System PLL Deinitialize.*/
static inline void CLOCK_DenitSystemPll(void)
{
    /* Power off PLL */
    SYSCON->PDRUNCFG |= SYSCON_PDRUNCFG_SYSPLL_PD_MASK;
}

/* @} */

/*!
 * @name Fractional clock operations
 * @{
 */

/*! @brief Set FRG0 output frequency.
 * @param freq Target output frequency, freq < input and (input / freq) < 2 should be satisfy.
 * @retval true - successfully, false - input argument is invalid.
 *
 */
bool CLOCK_SetFRG0ClkFreq(uint32_t freq);

/*! @brief Set FRG1 output frequency.
 * @param freq Target output frequency, freq < input and (input / freq) < 2 should be satisfy.
 * @retval true - successfully, false - input argument is invalid.
 *
 */
bool CLOCK_SetFRG1ClkFreq(uint32_t freq);

/* @} */

/*!
 * @name External/internal oscillator clock operations
 * @{
 */

/*! @brief  Init external CLK IN, select the CLKIN as the external clock source.
 * @param clkInFreq external clock in frequency.
 */
void CLOCK_InitExtClkin(uint32_t clkInFreq);

/*! @brief  Init SYS OSC
 * @param oscFreq oscillator frequency value.
 */
void CLOCK_InitSysOsc(uint32_t oscFreq);

/*! @brief  XTALIN init function
 *  system oscillator is bypassed, sys_osc_clk is fed driectly from the XTALIN.
 *  @param xtalInFreq XTALIN frequency value
 *  @return Frequency of PLL
 */
void CLOCK_InitXtalin(uint32_t xtalInFreq);

/*! @brief  Deinit SYS OSC
 */
static inline void CLOCK_DeinitSysOsc(void)
{
    /* Deinit system osc power */
    SYSCON->PDRUNCFG |= SYSCON_PDRUNCFG_SYSOSC_PD_MASK;
}

/*! @brief Set FRO oscillator output frequency.
 *  Initialize the FRO clock to given frequency (36, 48 or 60 MHz).
 * @param freq Please refer to clock_fro_osc_freq_t definition, frequency must be one of 36000, 48000 or 60000 KHz.
 *
 */
static inline void CLOCK_SetFroOscFreq(clock_fro_osc_freq_t freq)
{
    (*((void (*)(uint32_t freq))(CLOCK_FRO_SETTING_API_ROM_ADDRESS)))(freq);
}

/* @} */

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
